makerdiary/nrf52840-mdk-usb-dongle/workspace/cli/main.c
    sleep();
}

/**@brief Processes PUBACK message from a gateway.
 *
 * @details This function puts the client in sleep mode.
 */
static void puback_callback(void)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "puback_callback");
    sleep();
}

/**@brief Processes DISCONNECT message being a response to sleep request.
 *
 * @details This function puts the client in sleep mode.
 */
static void sleep_callback(void)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "sleep_callback");
    sleep();
}

/**@brief Processes callback from keep-alive timer timeout.
 *
 * @details This function puts the client in active mode.
 */
static void wakeup_callback(void)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "wakeup_callback");
    wake_up();
}

/**@brief Processes retransmission limit reached event. */
static void timeout_callback(mqttsn_event_t * p_event)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Timed-out message: %d. Message ID: %d.\r\n",
                  p_event->event_data.error.msg_type,
                  p_event->event_data.error.msg_id);

}

/**@brief Processes results of gateway discovery procedure. */
static void searchgw_timeout_callback(mqttsn_event_t * p_event)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Gateway discovery result: 0x%x.\r\n", p_event->event_data.discovery);
    sleep();
}

/**@brief Function for handling MQTT-SN events. */
void mqttsn_evt_handler(mqttsn_client_t * p_client, mqttsn_event_t * p_event)
{
    switch (p_event->event_id)
    {
        case MQTTSN_EVENT_GATEWAY_FOUND:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Client has found an active gateway.");
            gateway_info_callback(p_event);
            break;

        case MQTTSN_EVENT_CONNECTED:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Client connected.");
            connected_callback();
            break;

        case MQTTSN_EVENT_DISCONNECTED:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Client disconnected.");
            disconnected_callback();
            break;

        case MQTTSN_EVENT_REGISTERED:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Client registered topic.");
            regack_callback(p_event);
            break;

        case MQTTSN_EVENT_PUBLISHED:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Client has successfully published content.");
            puback_callback();
            break;

        case MQTTSN_EVENT_SLEEP_PERMIT:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Client permitted to sleep.");
            sleep_callback();
            break;

        case MQTTSN_EVENT_SLEEP_STOP:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Client wakes up.");
            wakeup_callback();
            break;

        case MQTTSN_EVENT_TIMEOUT:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Retransmission retries limit has been reached.");
            timeout_callback(p_event);
            break;

        case MQTTSN_EVENT_SEARCHGW_TIMEOUT:
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "MQTT-SN event: Gateway discovery procedure has finished.");
            searchgw_timeout_callback(p_event);
            break;

        default:
            break;
    }
}

/**@brief Function for initializing the MQTTSN client.
 */
static void mqttsn_init(void)
{
    uint32_t err_code = mqttsn_client_init(&m_client,
                                           MQTTSN_DEFAULT_CLIENT_PORT,
                                           mqttsn_evt_handler,
                                           thread_ot_instance_get());
    APP_ERROR_CHECK(err_code);

    connect_opt_init();
}

/***************************************************************************************************
 * @section buttons
 **************************************************************************************************/

static void led_state_pub(uint8_t led_state)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Publishing led state: %d", led_state);
    char msg[] = "{ \"test\" : true }";

    uint32_t err_code = mqttsn_client_publish(&m_client, m_topic.topic_id, (uint8_t *)&msg, 18, &m_msg_id);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code)
    }
}

static void publish(void)
{
    m_led_state = m_led_state == 1 ? 0 : 1;
    led_state_pub(m_led_state);
}

int mqtt_state = 0;

static void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;

    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "bsp_event_handler %d", event);
    
    if (otThreadGetDeviceRole(thread_ot_instance_get()) < OT_DEVICE_ROLE_CHILD )
    {
        otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "THREAD: Got role < CHILD");
        (void)event;
        return;
    }

    if (event == BSP_EVENT_KEY_0) 
    {
        if (mqtt_state == 0) 
        {
            wake_up();

            uint32_t err_code = mqttsn_client_search_gateway(&m_client, SEARCH_GATEWAY_TIMEOUT);
            if (err_code != NRF_SUCCESS)
            {
                NRF_LOG_ERROR("SEARCH GATEWAY message could not be sent. Error: 0x%x\r\n", err_code);
                otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "SEARCH GATEWAY message could not be sent. Error: 0x%x\r\n", err_code);
            }
            else {
                otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Maybe found gateway?");
                mqtt_state = 1;
            }
        }
        else if(mqtt_state == 1) 
        {
            wake_up();

            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Sent CONNECT");
            err_code = mqttsn_client_connect(&m_client, &m_gateway_addr, m_gateway_id, &m_connect_opt);
            if (err_code != NRF_SUCCESS)
            {
                otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "CONNECT message could not be sent. Error: 0x%x\r\n", err_code);
            }

            mqtt_state = 2;
        }
        else if(mqtt_state == 2) 
        {
            wake_up();
            if (mqttsn_client_state_get(&m_client) != MQTTSN_CLIENT_CONNECTED)
            {
                otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Sent CONNECT");
                err_code = mqttsn_client_connect(&m_client, &m_gateway_addr, m_gateway_id, &m_connect_opt);
                if (err_code != NRF_SUCCESS)
                {
                    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "CONNECT message could not be sent. Error: 0x%x\r\n", err_code);
                }
            }
            
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Publish");
            publish();
        }
    }
}


/***************************************************************************************************
 * @section SAADC
 **************************************************************************************************/
void timer_handler(nrf_timer_event_t event_type, void * p_context)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "SAADC timer fired");
}

void saadc_sampling_event_init(void)
{
    ret_code_t err_code;

